#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "default"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_eip.bastion will be created
  + resource "aws_eip" "bastion" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "bastion"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc                  = true
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                          = "ami-09282971cf2faa4c9"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = "ap-northeast-2a"
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.nano"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "micro-bastion"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name"        = "bastion"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "micro"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.bastion will be created
  + resource "aws_key_pair" "bastion" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "micro-bastion"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDq0qqQjtl/JdtjFtQmpy69LJQ32LPKXq9L6cdb9KMC03uDA4Ox72Jw0yLMW0dcf273GloXkE5bob5w7zvfAEAhwkxp+hvVac0UJ8ROerI4kRbU1ICn1ZmF1isPdX1kxkfHhKrMkV3EWMxHy8/1oeXmbAILePm2A2i7xyaI1o01XT5N0/yUlDUwCzDiZQQ4kUqRt4nZzunq3q/FCQEaAH5iYbV1URMc/+/WFGuZJNGt0gE9BkZHjU0mkORHX6Z8sWt6K1E0LY5dI57KrzjAYNPoEnIHwdzAhGvH2BpDqB8ZxA6lbR7hcwAvgvNA3gez/5gL/5xQXgC/ojA7wuaEfGa9 bastion"
      + tags        = {
          + "Name"        = "micro-bastion"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
    }

  # aws_key_pair.default will be created
  + resource "aws_key_pair" "default" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "micro-default"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDbv4/DRF4575g6pTjlG7YhUdrOoJh1okNwDBL8wdCwYDTqEgyFhVB1svhZGndDQ9rCZwyVxgyJrxKkKhQMwugTEQK0ggSS31mZ/D/9za8wy0kaNln1KlqCzcKKs6c2kFCTwj9LK0IAwhEcG1tFOabMMD4a3TY3QYAccAhkJp2kkZi7zrljAnuFi3zLnLTm5vXLsDSuyh8LzGkd+0aLU6HaemcWkpCBTFEMwEHeRLj7q1R+1b3vnZTyWQK3i7Y1UW8U9tzjf9cyZCqB6cs2sH6ClKOF+HtgxqJnMUNYPrt3THzDvVwrIUUhZ876bqP1Mkg1wt+s934exWM3Y/Z3O60X default"
      + tags        = {
          + "Name"        = "micro-default"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
    }

  # aws_network_acl.public will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name"        = "public"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id     = (known after apply)
    }

  # aws_resourcegroups_group.main will be created
  + resource "aws_resourcegroups_group" "main" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "micro"
      + tags = {
          + "Name"        = "micro"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }

      + resource_query {
          + query = jsonencode(
                {
                  + ResourceTypeFilters = [
                      + "AWS::AllSupported",
                    ]
                  + TagFilters          = [
                      + {
                          + Key    = "Project"
                          + Values = [
                              + "micro",
                            ]
                        },
                    ]
                }
            )
          + type  = "TAG_FILTERS_1_0"
        }
    }

  # aws_route53_record.bastion will be created
  + resource "aws_route53_record" "bastion" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bastion.micro.internal"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.private will be created
  + resource "aws_route53_zone" "private" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "micro.internal"
      + name_servers  = (known after apply)
      + tags          = {
          + "Name"        = "private"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = (known after apply)
          + vpc_region = (known after apply)
        }
    }

  # aws_route_table.public_primary will be created
  + resource "aws_route_table" "public_primary" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name"        = "public_primary"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_secondary will be created
  + resource "aws_route_table" "public_secondary" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name"        = "public_secondary"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public_primary will be created
  + resource "aws_route_table_association" "public_primary" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_secondary will be created
  + resource "aws_route_table_association" "public_secondary" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.public_ssh will be created
  + resource "aws_security_group" "public_ssh" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_ssh"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "public_ssh"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.public_primary will be created
  + resource "aws_subnet" "public_primary" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "public_primary"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public_secondary will be created
  + resource "aws_subnet" "public_secondary" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "public_secondary"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"        = "micro"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_public_ip         = (known after apply)
  + default_key_pair_name     = "micro-default"
  + default_security_group_id = (known after apply)
  + project                   = "micro"
  + public_subnet_ids         = [
      + (known after apply),
      + (known after apply),
    ]
  + region                    = "ap-northeast-2"
  + vpc_id                    = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @tunarider, Action: `pull_request`*